#ifndef _COMMUNICASION_H_
#define _COMMUNICASION_H_
/****************************************************************************/
/* ファイル名 : communication.h												*/
/* 概要       : 通信クラスヘッダ											*/
/****************************************************************************/

/****************************************************************************/
/* インクルードファイル														*/
/****************************************************************************/
#include "ecrobot_interface.h"

/****************************************************************************/
/* define定義・マクロ定義													*/
/****************************************************************************/
#define	COMM_CMD_START		(1)					/* 走行開始					*/
#define	COMM_CMD_STOP		(2)					/* 走行停止					*/
#define	COMM_CMD_FB			(3)					/* 前後進					*/
#define	COMM_CMD_LR			(4)					/* 左右旋回					*/


/****************************************************************************/
/* クラス操作(Public)														*/
/****************************************************************************/
void	COMM_initializeDevice(void);			/* デバイスを初期化する		*/
void	COMM_terminateDevice(void);				/* デバイスを終了する		*/
void	COMM_initialize(void);					/* 初期化する				*/
int		COMM_isReceived(void);					/* 受信データ有無を取得する	*/
void	COMM_getCmdInfo(S8 *cmd, S8 *value);	/* コマンド情報を取得する	*/

#endif	/* _COMMUNICASION_H_ */
