/****************************************************************************/
/* ファイル名 : main.c														*/
/* 概要       : メインタスク												*/
/****************************************************************************/

/****************************************************************************/
/* インクルードファイル														*/
/****************************************************************************/
#include "kernel.h"
#include "kernel_id.h"
#include "controller.h"


/****************************************************************************/
/* 関数名	: ecrobot_device_initialize										*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: ECROBOTデバイス初期化処理フック関数							*/
/****************************************************************************/
void ecrobot_device_initialize()
{
	/* コントローラデバイスの初期化 */
	CTRL_initializeDevice();
}

/****************************************************************************/
/* 関数名	: ecrobot_device_terminate										*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: ECROBOTデバイス終了処理フック関数								*/
/****************************************************************************/
void ecrobot_device_terminate()
{
	/* コントローラデバイスの終了 */
	CTRL_terminateDevice();
}

/****************************************************************************/
/* 関数名	: user_1ms_isr_type2											*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: 1msec周期割り込みフック関数(OSEK ISR type2カテゴリ)			*/
/****************************************************************************/
void user_1ms_isr_type2(void)
{
}

/****************************************************************************/
/* タスク名	: TaskMain														*/
/* 概要		: メインタスク													*/
/****************************************************************************/
TASK(TaskMain)
{
	/* 初期化する */
	CTRL_initialize();

	while(1){
		/* 制御を実行する */
		CTRL_execute();

		/* 4msecウェイト */
		systick_wait_ms(4);
	}
}
