/****************************************************************************/
/* ファイル名 : tail.c														*/
/* 概要       : 尻尾クラス													*/
/****************************************************************************/

/****************************************************************************/
/* インクルードファイル														*/
/****************************************************************************/
#include "kernel.h"
#include "kernel_id.h"
#include "system.h"
#include "tail.h"

/****************************************************************************/
/* define定義・マクロ定義													*/
/****************************************************************************/
#define TAIL_P_GAIN			(2.3F)			/* 尻尾用モータ制御比例係数		*/
#define TAIL_PWM_MAX		(60)			/* 尻尾用モータ制御PWM最大値	*/

/****************************************************************************/
/* クラス属性																*/
/****************************************************************************/
typedef struct {
	int	ang;								/* 角度[度]						*/
	int	count;								/* 回転角度[度]					*/
} TAIL;


/****************************************************************************/
/* クラス操作(Private)														*/
/****************************************************************************/
static int calc_pwmTail(void);				/* PWM値を計算する				*/



/****************************************************************************/
/* インスタンス																*/
/****************************************************************************/
static TAIL	sTail;							/* 尻尾							*/


/****************************************************************************/
/* 関数名	: TAILl_initialize												*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: 初期化する													*/
/****************************************************************************/
void TAIL_initialize(void)
{
	nxt_motor_set_speed(PORT_TAIL, 0, 1);	/* モータ動作停止				*/
	nxt_motor_set_count(PORT_TAIL, 0);		/* エンコーダリセット			*/

	sTail.count = nxt_motor_get_count(PORT_TAIL);
	sTail.ang = TAIL_ANGLE_MIN;
}

/****************************************************************************/
/* 関数名	: TAIL_setPosition												*/
/* 引数		: ang : 角度													*/
/* 戻り値	: なし															*/
/* 概要		: 位置を決める													*/
/****************************************************************************/
void TAIL_setPosition(int ang)
{
	if(ang < TAIL_ANGLE_MIN){
		sTail.ang = TAIL_ANGLE_MIN;
	}
	else if(ang > TAIL_ANGLE_MAX){
		sTail.ang = TAIL_ANGLE_MAX;
	}
	else{
		sTail.ang = ang;
	}
}

/****************************************************************************/
/* 関数名	: TAIL_control													*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: 制御する														*/
/* 特記事項	: 4ms間隔で実行すること											*/
/****************************************************************************/
void TAIL_control(void)
{
	sTail.count = nxt_motor_get_count(PORT_TAIL);
	nxt_motor_set_speed(PORT_TAIL, calc_pwmTail(), 1);
}

/****************************************************************************/
/* 関数名	: calc_pwmTail													*/
/* 引数		: なし															*/
/* 戻り値	: PWM値															*/
/* 概要		: PWM値を計算する												*/
/****************************************************************************/
static int calc_pwmTail(void)
{
	F32 pwm;

	pwm = (F32)(sTail.ang - sTail.count) * TAIL_P_GAIN;
	if( pwm > TAIL_PWM_MAX){
		pwm = TAIL_PWM_MAX;
	}
	else if(pwm < -TAIL_PWM_MAX){
		pwm = -TAIL_PWM_MAX;
	}
	else{
		// そのまま計算したpwm値を使う
	}
	
	return((int)pwm);
}
