/****************************************************************************/
/* ファイル名 : touch.c														*/
/* 概要       : タッチセンサクラス											*/
/****************************************************************************/

/****************************************************************************/
/* インクルードファイル														*/
/****************************************************************************/
#include "kernel.h"
#include "kernel_id.h"
#include "system.h"
#include "touch.h"

/****************************************************************************/
/* クラス属性																*/
/****************************************************************************/
typedef struct {
	U8	onoffPst;							/* ONOFF前回状態				*/
	U8	edgeOn;								/* ON立ち上がり					*/
} TOUCH;


/****************************************************************************/
/* インスタンス																*/
/****************************************************************************/
static TOUCH	sTouch;						/* タッチセンサ					*/


/****************************************************************************/
/* 関数名	: TOUCH_initialize												*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: 初期化する													*/
/****************************************************************************/
void TOUCH_initialize(void)
{
	sTouch.onoffPst = false;
	sTouch.edgeOn   = false;
}

/****************************************************************************/
/* 関数名	: TOUCH_isPressed												*/
/* 引数		: なし															*/
/* 戻り値	: 押下状態														*/
/*			:   1 : OFF→ONに変化											*/
/*			:   0 : 上記以外に変化											*/
/* 概要		: 押下状態を取得する											*/
/****************************************************************************/
U8 TOUCH_isPressed(void)
{
	U8	ret;

	ret = sTouch.edgeOn;
	sTouch.edgeOn = false;
	return(ret);
}

/****************************************************************************/
/* 関数名	: TOUCH_updateState												*/
/* 引数		: なし															*/
/* 戻り値	: なし															*/
/* 概要		: 押下状態を更新する											*/
/* 特記事項	: 100ms間隔で実行すること										*/
/****************************************************************************/
void TOUCH_updateState(void)
{
	U8	press;

	press = ecrobot_get_touch_sensor(PORT_TOUCH);
	if((press == true) && (sTouch.onoffPst == false)){
		if(sTouch.edgeOn == false){
			sTouch.edgeOn = true;
		}
	}
	sTouch.onoffPst = press;
}
